<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_tensor" type="Parameter" version="opset1">
			<data shape="1, 3, 512, 512" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,StatefulPartitionedCall/Cast:0,input_tensor:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_46513" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="0" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/Preprocessor/truediv/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_46515" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="12" size="12"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/Preprocessor/sub/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/Preprocessor/stack:0,StatefulPartitionedCall/Preprocessor/truediv_1:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="24" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_conv2d/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_4651846523" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3480" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stem_activation/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3608" size="1152"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_conv2d/depthwise/ReadVariableOp:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_4652646531" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4760" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/depthwise_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_squeeze/MeanGather6513084059" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="4888" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_squeeze/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_squeeze/Mean:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4904" size="32"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape/Transpose/value5644782169" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4936" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reshape/Reshape:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="8, 32, 1, 1" offset="4968" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/Conv2D/ReadVariableOp:0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="5992" size="32"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_reduce_activation/mul:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 1, 1" offset="6024" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7048" size="128"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_activation/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_expand_activation/Sigmoid:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_excite/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/se_excite/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/project_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="7176" size="2048"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/project_conv2d/Conv2D/ReadVariableOp:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/project_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="data_add_4653446539" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9224" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/project_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/id/Identity:0,StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_0/block_0/project_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 16, 1, 1" offset="9288" size="6144"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_conv2d/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_4654246547" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="15432" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/expand_activation/mul:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="15816" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_conv2d/depthwise/ReadVariableOp:0">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_4655046555" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="19272" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/depthwise_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_squeeze/MeanGather6511883189" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="4888" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_squeeze/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_squeeze/Mean:0">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="19656" size="32"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape/Transpose/value5645182037" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4936" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reshape/Reshape:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="4, 96, 1, 1" offset="19688" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/Conv2D/ReadVariableOp:0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 4, 1, 1" offset="21224" size="16"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_reduce_activation/mul:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="96, 4, 1, 1" offset="21240" size="1536"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/Conv2D/ReadVariableOp:0">
					<dim>96</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="22776" size="384"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_activation/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_expand_activation/Sigmoid:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_excite/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/se_excite/mul:0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/project_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="24, 96, 1, 1" offset="23160" size="9216"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/project_conv2d/Conv2D/ReadVariableOp:0">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/project_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="data_add_4655846563" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="32376" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/project_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/id/Identity:0,StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_0/project_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 24, 1, 1" offset="32472" size="13824"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_conv2d/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_4656646571" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="46296" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/expand_activation/mul:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="144, 1, 1, 3, 3" offset="46872" size="5184"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_conv2d/depthwise/ReadVariableOp:0">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_conv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="data_add_4657446579" type="Const" version="opset1">
			<data element_type="f32" shape="1, 144, 1, 1" offset="52056" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_bn/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_bn/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/depthwise_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_squeeze/MeanGather6509882319" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="4888" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_squeeze/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_squeeze/Mean:0">
					<dim>1</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="52632" size="32"/>
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape/shape:0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape/Transpose/value5645582067" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4936" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reshape/Reshape:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="6, 144, 1, 1" offset="52664" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/Conv2D/ReadVariableOp:0">
					<dim>6</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>6</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 6, 1, 1" offset="56120" size="24"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_conv2d/BiasAdd:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_activation/mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_reduce_activation/mul:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_expand_conv2d/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="144, 6, 1, 1" offset="56144" size="3456"/>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_expand_conv2d/Conv2D/ReadVariableOp:0">
					<dim>144</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_expand_conv2d/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>6</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/EfficientDet-D0/functional_1/stack_1/block_1/se_expand_conv2d/Conv2D:0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
